Revit 2026 API

# CurtainGridLineRemoveSegment Method

---

Remove the segment specified by the input curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSegment(
	Curve curve
)
```
```vb
Public Sub RemoveSegment (
	curve As Curve
)
```
```cpp
public:
void RemoveSegment(
	Curve^ curve
)
```
```fsharp
member RemoveSegment :
        curve : Curve -> unit
```

#### Parameters

curve Curve
     The curve used to locate the segment to be removed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Segment may not have been found in location indicated by curve. |

When a segment is removed, the neighboring two panels will be merged into one panel. This function will invoke regeneration.

#### Reference

CurtainGridLine Class

Autodesk.Revit.DB Namespace